
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5706693263)



<pre><code>Apply complete! Resources: 24 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.network.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for bined-hasura"
      + id                      = (known after apply)
      + name                    = "bined-hasura"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "bined-hasura"
        }
      + tags_all                = {
          + "Name" = "bined-hasura"
        }
      + vpc_id                  = (known after apply)
    }

  # module.network.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "bined-hasura-default"
        }
      + tags_all               = {
          + "Name" = "bined-hasura-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.network.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "bined-hasura-default"
        }
      + tags_all               = {
          + "Name" = "bined-hasura-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.network.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "bined-hasura-default"
        }
      + tags_all               = {
          + "Name" = "bined-hasura-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "bined-hasura-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "bined-hasura-ap-northeast-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.network.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "bined-hasura"
        }
      + tags_all = {
          + "Name" = "bined-hasura"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "bined-hasura-ap-northeast-1a"
        }
      + tags_all                           = {
          + "Name" = "bined-hasura-ap-northeast-1a"
        }
    }

  # module.network.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bined-hasura-private"
        }
      + tags_all         = {
          + "Name" = "bined-hasura-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bined-hasura-public"
        }
      + tags_all         = {
          + "Name" = "bined-hasura-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "bined-hasura-db-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Name" = "bined-hasura-db-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "bined-hasura-db-ap-northeast-1c"
        }
      + tags_all                                       = {
          + "Name" = "bined-hasura-db-ap-northeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "bined-hasura-private-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Name" = "bined-hasura-private-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "bined-hasura-private-ap-northeast-1c"
        }
      + tags_all                                       = {
          + "Name" = "bined-hasura-private-ap-northeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "bined-hasura-public-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Name" = "bined-hasura-public-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "bined-hasura-public-ap-northeast-1c"
        }
      + tags_all                                       = {
          + "Name" = "bined-hasura-public-ap-northeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "bined-hasura"
        }
      + tags_all                             = {
          + "Name" = "bined-hasura"
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.
module.network.aws_vpc.this[0]: Creating...
module.network.aws_vpc.this[0]: Still creating... [10s elapsed]
module.network.aws_vpc.this[0]: Creation complete after 13s [id=vpc-0a20ed93f94539036]
module.network.aws_internet_gateway.this[0]: Creating...
module.network.aws_route_table.private[0]: Creating...
module.network.aws_default_network_acl.this[0]: Creating...
module.network.aws_subnet.private[0]: Creating...
module.network.aws_default_security_group.this[0]: Creating...
module.network.aws_route_table.public[0]: Creating...
module.network.aws_default_route_table.default[0]: Creating...
module.network.aws_subnet.database[0]: Creating...
module.network.aws_subnet.public[1]: Creating...
module.network.aws_subnet.private[1]: Creating...
module.network.aws_default_route_table.default[0]: Creation complete after 1s [id=rtb-05c8ef1ecd42c0a1c]
module.network.aws_subnet.public[0]: Creating...
module.network.aws_route_table.private[0]: Creation complete after 2s [id=rtb-0bb4120b65c92a107]
module.network.aws_subnet.database[1]: Creating...
module.network.aws_subnet.private[0]: Creation complete after 2s [id=subnet-0f0bc25f4fe692b9f]
module.network.aws_subnet.database[0]: Creation complete after 2s [id=subnet-06e0f4cbee44e1b7e]
module.network.aws_route_table.public[0]: Creation complete after 2s [id=rtb-0100ed7567dfa4692]
module.network.aws_subnet.public[1]: Creation complete after 2s [id=subnet-0824e210311fe3361]
module.network.aws_internet_gateway.this[0]: Creation complete after 2s [id=igw-04d47fac8f245bf03]
module.network.aws_route.public_internet_gateway[0]: Creating...
module.network.aws_eip.nat[0]: Creating...
module.network.aws_subnet.private[1]: Creation complete after 2s [id=subnet-04e257e755c87b631]
module.network.aws_route_table_association.private[0]: Creating...
module.network.aws_route_table_association.private[1]: Creating...
module.network.aws_subnet.public[0]: Creation complete after 1s [id=subnet-06e4b653ba82a0dbb]
module.network.aws_route_table_association.public[1]: Creating...
module.network.aws_route_table_association.public[0]: Creating...
module.network.aws_subnet.database[1]: Creation complete after 1s [id=subnet-012d2f4ea363148d7]
module.network.aws_route_table_association.database[0]: Creating...
module.network.aws_route_table_association.database[1]: Creating...
module.network.aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-09c3069fee8860280]
module.network.aws_db_subnet_group.database[0]: Creating...
module.network.aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-0e5ff3a153cc05fb7]
module.network.aws_default_network_acl.this[0]: Creation complete after 3s [id=acl-02f2e05642c4a4f10]
module.network.aws_route.public_internet_gateway[0]: Creation complete after 1s [id=r-rtb-0100ed7567dfa46921080289494]
module.network.aws_route_table_association.public[0]: Creation complete after 1s [id=rtbassoc-0ff62e3874f25450b]
module.network.aws_eip.nat[0]: Creation complete after 1s [id=eipalloc-0dc75306fafe9d656]
module.network.aws_default_security_group.this[0]: Creation complete after 3s [id=sg-0e49e03a5db24049b]
module.network.aws_nat_gateway.this[0]: Creating...
module.network.aws_route_table_association.public[1]: Creation complete after 1s [id=rtbassoc-0970af91d0fee328c]
module.network.aws_route_table_association.database[0]: Creation complete after 0s [id=rtbassoc-0c5f41ee2056851dc]
module.network.aws_route_table_association.database[1]: Creation complete after 0s [id=rtbassoc-02aab784abc51b12a]
module.network.aws_db_subnet_group.database[0]: Creation complete after 1s [id=bined-hasura]
module.network.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.network.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
module.network.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.network.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
module.network.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.network.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
module.network.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.network.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
module.network.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]
module.network.aws_nat_gateway.this[0]: Creation complete after 1m36s [id=nat-0dc82545eb07c4ac9]
module.network.aws_route.private_nat_gateway[0]: Creating...
module.network.aws_route.private_nat_gateway[0]: Creation complete after 1s [id=r-rtb-0bb4120b65c92a1071080289494]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 24 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":2,"Program":"tfcmt","SHA1":"068f01fbd117110e5620f4a2573a300623a262dc","Vars":{},"WorkflowName":"Terraform"} -->